Revit 2027 API
BuiltInFailures.ViewFailures.ViewPublishFailed Property
 The following views could not be published.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewPublishFailed { get; }
Public Shared ReadOnly Property ViewPublishFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewPublishFailed {
	FailureDefinitionId^ get ();
}
static member ViewPublishFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace